export default {
  data(){
    return{
      allEvents: {
        //0-1 剧情+教程
        0: {
          id: 0,
          desc: "初始文案",
          options: [
            {
              text: "...",
              next: 1
            }
          ],
          once: true
        },
        1: {
          id: 1,
          desc: "教程",
          options: [
            {
              text: "点我",
              result: [[50,0,0],[],[]]
            },
            {
              text: "点我吧",
              result: [[0,5,0],[],[]]
            },
            {
              text: "别信前面的",
              result: [[0,0,5],[],[]]
            }
          ],
          result: [[],[],[[100,199],200,210,220,404]],
        },

        //2-7 死亡事件 结局1-6
        2: {
          id: 2,
          desc: "战火已经绵延到了主城内，人民们已经开始组织逃亡，城内一片混乱。你跑到城堡中，却发现国王已经不见了，回头一看，整个城池已经沦为一片火海，你缓缓戴上了头盔，拿起了武器，走入了火海之中...\n\n结局1",
          options: [
            {
              text: "重新开始",
            }
          ]
        },
        3: {
          id: 3,
          desc: "瘟疫已经达到无法控制的程度，人民已经失去了所有的希望，虽是白天，但天空没有一丝光芒。城里没有一滴血，却已是横尸遍野。你坐在河边，仰望着天空，一切都已经结束了...\n\n结局2",
          options: [
            {
              text: "重新开始",
            }
          ]
        },
        4: {
          id: 4,
          desc: "河水里没有一滴水，田野里没有一根庄稼，天空盘旋着群群乌鸦，一声声惨叫，成为了人们的丧钟。你站立在丧尸般的人群当中，聆听着最后的悲鸣曲...\n\n结局3",
          options: [
            {
              text: "重新开始",
            }
          ]
        },
        5: {
          id: 5,
          desc: "愤怒的你过于渴望力量，已经走火入魔，最后在远征的路上化成了一块石头...\n\n结局4",
          options: [
            {
              text: "重新开始",
            }
          ]
        },
        6: {
          id: 6,
          desc: "嫉妒之心逐渐被病魔侵蚀，明明天下已经没有瘟疫了，可为什么只有你一人得了这种不治之症...\n\n结局5",
          options: [
            {
              text: "重新开始",
            }
          ]
        },
        7: {
          id: 7,
          desc: "贪婪让你腰缠万贯，让你享尽荣华富贵，最终在宫殿的后院里七窍流血而死...\n\n结局6",
          options: [
            {
              text: "重新开始",
            }
          ]
        },

        //100-199 重复事件
        //国王
        100: {
          id: 100,
          desc: "由于军备薄弱，国王下令提高农民的税收来加强军队的建设",
          options: [
            {
              text: "私藏一部分税收",
              result: [[0,-3,5],[],[]]
            },
            {
              text: "全部上缴",
              result: [[5,-3,0],[],[]]
            },
            {
              text: "拿自己的钱抵农夫那一部分",
              result: [[3,0,-5],[],[]]
            }
          ],
        },
        101: {
          id: 101,
          desc: "国王在外出狩猎时受伤了",
          options: [
            {
              text: "御医！",
              result: [[0,-3,3],[],[]]
            },
            {
              text: "视而不见",
            },
            {
              text: "我早就说过不要狩猎了",
              result: [[-3,3,-3],[],[]]
            }
          ]
        },
        102: {
          id: 102,
          desc: "上个季度的粮食收成提高了，国王准备大摆宴席庆祝",
          options: [
            {
              text: "陛下，实在没有必要",
              result: [[3,-5,0],[],[]]
            },
            {
              text: "尽情享受",
              result: [[-3,3,-5],[],[]]
            },
            {
              text: "不出席宴席",
              result: [[-3,0,-5],[],[]]
            }
          ]
        },
        103: {
          id: 103,
          desc: "最近瘟疫的情势更加严重了，国王很苦恼",
          options: [
            {
              text: "应该多建立诊所",
              result: [[0,5,-5],[],[]]
            },
            {
              text: "军火连天，应注重军事储备",
              result: [[3,-5,0],[],[]]
            },
            {
              text: "民以食为天，应先发展农业",
              result: [[0,-5,3],[],[]]
            },
            {
              text: "无为而治",
            }
          ]
        },
        //104
        //小丑
        105: {
          id: 105,
          desc: "乌拉！小丑的猜弹珠小游戏！",
          options: [
            {
              text: "这个"
            },
            {
              text: "这个"
            },
            {
              text: "这个"
            },
          ],
          eval: `this.changeAttr(null,null,Math.random()<0.33?10:-5);`
        },
        106: {
          id: 106,
          desc: "乌拉！小丑的潘多拉魔盒！",
          options: [
            {
              text: "无视他",
              result: [[-1,-1,-1],[],[]]
            },
            {
              text: "晃一晃",
              eval: `this.changeAttr(null,null,Math.floor(Math.random()*5)-2);`
            },
            {
              text: "闻闻是什么味",
              eval: `this.changeAttr(null,Math.floor(Math.random()*5)-2,null);`
            },
            {
              text: "打开",
              eval: `this.changeAttr(Math.floor(Math.random()*5)-2,null,null);`
            }
          ]
        },
        107: {
          id: 107,
          desc: "乌拉！小丑的扮演国王戏剧！",
          options: [
            {
              text: "快把皇冠摘下来！",
              result: [[3,0,0],[],[]]
            },
            {
              text: "哈哈哈哈哈哈",
              result: [[0,3,0],[],[]]
            },
            {
              text: "这可真蠢",
              result: [[0,0,3],[],[]]
            },
            {
              text: "不作评价",
              result: [[1,1,1],[],[]]
            }
          ]
        },
        //108
        //109
        //农民
        110: {
          id: 110,
          desc: "由于打了败仗，国王提高了农夫的税收，粮食的收成又要降低，这是谁的错呢",
          options: [
            {
              text: "国王",
              result: [[0,-5,5],[],[]]
            },
            {
              text: "农民",
              result: [[5,0,-10],[],[]]
            },
            {
              text: "士兵",
              result: [[-5,3,3],[],[]]
            }
          ]
        },
        111: {
          id: 111,
          desc: "最近狼群总是在夜晚入侵农夫的庄园，害得农夫每天晚上都要守在庄园内驱赶狼群，但仍然阻止不了损失",
          options: [
            {
              text: "帮忙驱赶狼群",
              result: [[-5,3,5],[],[]]
            },
            {
              text: "自己想办法吧",
              result: [[5,-3,-5],[],[]]
            }
          ]
        },
        112: {
          id: 112,
          desc: "农夫的稻草人说它知道杀害农场主的凶手的谁...",
          disabled: true,
          options: [
            {
              text: "好好看守你的农田",
              result: [[0,0,5],[],[]]
            },
            {
              text: "告诉我",
              next: 113
            }
          ]
        },
        113: {
          id: 113,
          desc: "法官知道凶手是谁！",
          disabled: true,
          options: [
            {
              text: "你在忽悠我吗...",
            }
          ],
        },
        //114
        //商人
        115: {
          id: 115,
          desc: "你在森林里遇见了正赶路进城的商人，后边跟着他的骡子，扛着两大袋货物，似乎有点躲着你",
          options: [
            {
              text: "检查货物",
              result: [[0,-2,0],[],[]],
              next: 116
            },
            {
              text: "放他继续赶路",
              result: [[0,2,0],[],[]]
            }
          ]
        },
        116: {
          id: 116,
          desc: "你打开包袱，发现货物中有苹果，商人明显很紧张，这是明显的犯法行为...",
          disabled: true,
          options: [
            {
              text: "收下保护费，这事就当没发生",
              result: [[0,-3,5],[],[]]
            },
            {
              text: "销毁苹果，禁止商人七天不得进城",
              result: [[5,-3,0],[],[]]
            },
            {
              text: "当心别被发现了",
              result: [[-3,10,0],[],[]]
            }
          ]
        },
        117: {
          id: 117,
          desc: "商人在诊所门口摆摊，引起了病人的不满，他们想要安静的环境，而商人却总是能引来喧杂吵闹",
          options: [
            {
              text: "把商人赶走",
              result: [[5,3,-3],[],[]]
            },
            {
              text: "训斥病人",
              result: [[5,-5,0],[],[]]
            },
            {
              text: "不关我的事",
              result: [[-3,-3,0],[],[]]
            }
          ]
        },
        118: {
          id: 118,
          desc: "你听见人们的议论声，说商人经常往来于邻国贸易，他们觉得这是犯法行为，应该把商人处死",
          options: [
            {
              text: "当作没听到",
            },
            {
              text: "这应该不犯法",
              result: [[-3,3,3],[],[]]
            },
            {
              text: "这应该犯法了",
              result: [[3,-3,3],[],[]]
            }
          ]
        },
        //119
        //铁匠
        120: {
          id: 120,
          desc: "临近战争，所有战士们都需要维修自己的武器，你来到了铁匠铺",
          options: [
            {
              text: "维修",
              result: [[5,0,-5],[],[]]
            },
            {
              text: "离开",
            },
            {
              text: "给我个面子",
              result: [[3,-5,0],[],[]]
            }
          ],
        },
        121: {
          id: 121,
          desc: "铁匠铺里有个特殊的熔炉，是铁匠亲手造的，内部是个大容器，外侧可以放入一些材料，你看着非常感兴趣",
          options: [
            {
              text: "尝试着动动看",
              result: [[0,-5,0],[],[]],
              next: 122
            },
            {
              text: "还是不要乱动了",
            }
          ]
        },
        122: {
          id: 122,
          desc: "你把自己的袖剑抽出来放进中间的容器，桌台上有各种材料，放哪一种呢？",
          disabled: true,
          options: [
            {
              text: "树枝",
              eval: `this.changeAttr(Math.floor(Math.random()*11)-5,null,null);`
            },
            {
              text: "石头",
              result: [[1,0,0],[],[]]
            },
            {
              text: "沙子",
              eval: `this.changeAttr(Math.random()<0.33?10:-5,null,null);`
            }
          ]
        },
        123: {
          id: 123,
          desc: "上一次战役中折损了许多士兵，结果幸存的士兵们找上了铁匠，觉得是铁匠打造的装备不够精良",
          options: [
            {
              text: "赶走士兵",
              result: [[-5,10,0],[],[]]
            },
            {
              text: "声讨铁匠",
              result: [[5,-10,0],[],[]]
            },
            {
              text: "当作没看见",
              result: [[0,0,0],[],[]]
            },
            {
              text: "禀告国王",
              result: [[-5,-5,5],[],[]]
            }
          ]
        },
        //124
        //猎人
        125: {
          id: 125,
          desc: "猎人举起了猎枪，对准了猎物...",
          options: [
            {
              text: "开枪吧",
              result: [[5,5,0],[],[]]
            },
            {
              text: "再等一等",
              result: [[0,0,-5],[],[]]
            },
            {
              text: "等下一个猎物吧",
              result: [[-5,-5,5],[],[]]
            }
          ]
        },
        126: {
          id: 126,
          desc: "猎人住在森林的小屋里，门口的篝火从来不会熄灭",
          options: [
            {
              text: "一定是魔法",
              result: [[-5,0,5],[],[]]
            },
            {
              text: "他是恶魔",
              result: [[5,-5,0],[],[]]
            },
            {
              text: "这没什么",
              result: [[-3,5,-3],[],[]]
            }
          ]
        },
        127: {
          id: 127,
          desc: "猎人已骑上了马准备外出打猎",
          options: [
            {
              text: "一同前往",
              next: 128,
            },
            {
              text: "暂不同行",
              result: [[0,5,0],[],[]]
            }
          ]
        },
        128: {
          id: 128,
          desc: "森林里野兽横行，十分凶险，你准备攻击哪一只？",
          disabled: true,
          options: [
            {
              text: "兔子",
              eval: `if(this.characterData.wrath>30) this.changeAttr(1,1,3); else this.changeAttr(-1,-1,-3);`,
            },
            {
              text: "狼",
              eval: `if(this.characterData.wrath>50) this.changeAttr(2,2,7); else this.changeAttr(-10,-2,-5);`,
            },
            {
              text: "狮子",
              eval: `if(this.characterData.wrath>80) this.changeAttr(5,5,20); else this.changeAttr(-30,-5,-10);`,
            }
          ]
        },
        //129
        //医生
        130: {
          id: 130,
          desc: "医生给了你一把药丸，让你选一颗吃下去",
          options: [
            {
              text: "红药丸",
            },
            {
              text: "蓝药丸",
            },
            {
              text: "白药丸",
            },
            {
              text: "不吃",
            }
          ]
        },
        131: {
          id: 131,
          desc: "医生的高超艺术得到了公民的认可，他自称不仅白天为病人看病，最近夜里还在研究最新的瘟疫病毒，动物实验体的数据已经完整，现在需要新生婴儿当作实验体",
          options: [
            {
              text: "这简直荒唐！",
              result: [[0,-5,0],[],[]]
            },
            {
              text: "继续用动物研究",
              result: [[0,0,-5],[],[]]
            },
            {
              text: "这方面我不太懂",
              result: [[0,5,0],[],[]]
            },
            {
              text: "让民众贡献新生婴儿",
              result: [[0,20,0],[],[]]
            }
          ]
        },
        132: {
          id: 132,
          desc: "医生经常告诫他的病人：苹果是瘟疫之源，我们应该设立法律来严厉禁止这种水果的流通",
          options: [
            {
              text: "苹果明明是非常利于健康的水果",
              result: [[5,-5,0],[],[]]
            },
            {
              text: "医生说的对",
              result: [[-5,5,2],[],[]]
            }
          ]
        },
        133: {
          id: 133,
          desc: "路遇一位乞丐，身负重病，由于负担不起诊所的昂贵医药费，所以一直没有医治",
          options: [
            {
              text: "施舍一点钱",
              result: [[0,0,-5],[],[]]
            },
            {
              text: "施舍很多钱",
              result: [[0,5,-10],[],[]]
            },
            {
              text: "离开",
              result: [[0,0,0],[],[]]
            }
          ]
        },
        //134
        //神父
        135: {
          id: 135,
          desc: "神父向国王请示，要多建设教堂教化民众",
          options: [
            {
              text: "可以，但没必要",
              result: [[0,-5,0],[],[]]
            },
            {
              text: "教化非常重要",
              result: [[0,5,-5],[],[]]
            }
          ]
        },
        136: {
          id: 136,
          desc: "你来到教堂做祷告，发现在教堂的角落有一间告解室，你觉得最近你做的事情...",
          options: [
            {
              text: "我昨晚不应该出去打猎",
              result: [[6,-3,-3],[],[]]
            },
            {
              text: "我不应该欠铁匠钱",
              result: [[-3,6,-3],[],[]]
            },
            {
              text: "我不应该辱骂商人",
              result: [[-3,-3,6],[],[]]
            },
            {
              text: "我没做错什么",
            }
          ]
        },
        137: {
          id: 137,
          desc: "教堂的雕像活了，它说你只能保留一项属性不变...",
          options: [
            {
              text: "保留红色属性不变",
              eval: `this.swapAttr(0);`
            },
            {
              text: "保留紫色属性不变",
              eval: `this.swapAttr(1);`
            },
            {
              text: "保留蓝色属性不变",
              eval: `this.swapAttr(2);`
            }
          ]
        },
        //138
        //139
        //法官
        140: {
          id: 140,
          desc: "法官在和商人讨价还价",
          options: [
            {
              text: "商人明码标价，不许砍价",
              result: [[0,5,-5],[],[]]
            },
            {
              text: "法官工作辛苦，可以理解",
              result: [[0,-5,5],[],[]]
            },
            {
              text: "正好我需要这东西，我原价买了",
              result: [[5,-5,-5],[],[]]
            }
          ]
        },
        141: {
          id: 141,
          desc: "法官称最近犯罪的人数明显增加，需要增加治安管理的力度",
          options: [
            {
              text: "说的没错",
              result: [[5,0,-5],[],[]]
            },
            {
              text: "完全不需要",
              result: [[-5,-5,0],[],[]]
            },
            {
              text: "什么？",
              result: [[5,-5,0],[],[]]
            }
          ]
        },
        142: {
          id: 142,
          desc: "法官踩坏了农民的作物",
          options: [
            {
              text: "赔钱！",
              result: [[5,-5,0],[],[]]
            },
            {
              text: "当然是选择原谅他",
              result: [[0,-5,5],[],[]]
            },
            {
              text: "自己出钱赔偿农民",
              result: [[0,5,-5],[],[]]
            }
          ]
        },
        //143
        //144
        //145-x 其他重复事件

        //200-x 主线剧情
        //200-208 战争线
        200: {
          id: 200,
          desc: "战火已经绵延到了邻国，谁也不能保证今晚是否可以睡一个好觉，国王下令召集民兵入伍，你被选为百夫长，率领的士兵主要来自于下级阶层的百姓，但也有皇室训练的军人，你感到莫名的压力...",
          condition: [[50,0,0],[]],
          options: [
            {
              text: "...",
              result: [[0,0,0],[],[201]]
            }
          ],
          once: true,
        },
        201: {
          id: 201,
          desc: "一条巨龙袭击了城池北部的瞭望台，你召集了部下立刻前往，倒下的瞭望台引燃了北部仓库，百姓慌乱而逃，情况不容乐观...",
          options: [
            {
              text: "先疏散百姓",
              result: [[-5,5,-5],[],[]],
              next: 202
            },
            {
              text: "先攻击巨龙",
              result: [[5,-5,-5],[],[]],
              next: 203
            },
            {
              text: "先救火",
              result: [[-5,-5,5],[],[]],
              next: 204
            }
          ],
          once: true,
        },
        202: {
          id: 202,
          desc: "百姓被安全撤离，随后你与部下和巨龙展开殊死搏斗，最终击败巨龙。战后一位部下发现巨龙的嘴里有一颗散发着五彩斑斓的黑色的宝玉",
          options: [
            {
              text: "将此物放进背包",
              result: [[0,0,0],[11],[205]]
            },
            {
              text: "将此物交给国王",
              result: [[0,0,0],[],[207]]
            }
          ]
        },
        203: {
          id: 203,
          desc: "你与部下和巨龙展开殊死搏斗，最终击败巨龙。战后你发现巨龙的嘴里有一颗散发着五彩斑斓的黑色的宝玉",
          options: [
            {
              text: "将此物放进背包",
              result: [[0,0,0],[11],[205]]
            },
            {
              text: "将此物交给国王",
              result: [[0,0,0],[],[207]]
            }
          ]
        },
        204: {
          id: 204,
          desc: "火势很快得到控制，随后你与部下和巨龙展开殊死搏斗，最终击败巨龙。战后一位农民发现巨龙的嘴里有一颗散发着五彩斑斓的黑色的宝玉",
          options: [
            {
              text: "将此物放进背包",
              result: [[0,0,0],[11],[205]]
            },
            {
              text: "将此物交给国王",
              result: [[0,0,0],[],[207]]
            }
          ]
        },
        205: {
          id: 205,
          desc: "邻国已被毁灭的消息传遍了城池每个角落，在这紧张的关头，军队的收入并没有明显提高，很多新兵没有自己的武器，你把自己的佩剑上交给了国家，现在自己迫切需要一把新的兵器，于是你找到了铁匠",
          options: [
            {
              text: "我需要一把新的武器...",
              next: 206
            }
          ],
          once: true,
        },
        206: {
          id: 206,
          desc: "铁匠看见了你包中的宝玉，大吃一惊，他告诉你这是龙玉，用它锻造出来的武器拥有极强的力量",
          options: [
            {
              text: "给我也整一个！",
              result: [[10,0,-10],[-11,12],[]],
            }
          ],
        },
        207: {
          id: 207,
          desc: "国王四处打听宝玉的来历，终于在炼金术士口中得知这是一块龙玉，用它锻造出来的武器拥有极强的力量，国王立刻找到铁匠，让他用这块龙玉打造一把武器",
          condition: [[70,0,0],[]],
          options: [
            {
              text: "...",
              next: 208
            }
          ],
          once: true
        },
        208: {
          id: 208,
          desc: "铁匠打造出了一把大刀，同样发出五彩斑斓的黑色，国王看到之后非常高兴，将这把刀送给了你",
          options: [
            {
              text: "收下大刀",
              result: [[10,-5,0],[12],[]]
            }
          ]
        },
        //209
        //210-218 瘟疫线
        210: {
          id: 210,
          desc: "猎人告诉你，他得了一种奇怪的病，他有许多把弓箭，惟独其中一把，他一靠近就浑身难受，更别说拿它去打猎，奇怪的是只有他自己受到了影响，他怀疑是被一种特殊的瘟疫所感染，你建议猎人去看医生，猎人却说这不影响他的狩猎",
          condition: [[0,50,0],[]],
          options: [
            {
              text: "",
              result: [[0,0,0],[],[211]]
            }
          ],
          once: true
        },
        211: {
          id: 211,
          desc: "某一天你经过诊所的时候，突然想起猎人患上了一种奇怪的病，于是想找到医生询问，只不过很不巧的是医生今天不在诊所...",
          options: [
            {
              text: "去集市找医生",
              next: 212
            },
            {
              text: "去农田找医生",
              next: 214
            },
            {
              text: "去教堂找医生",
              next: 216
            }
          ],
          once: true
        },
        212: {
          id: 212,
          desc: "医生不在集市",
          options: [
            {
              text: "去农田找医生",
              next: 213
            },
            {
              text: "去教堂找医生",
              next: 216
            }
          ]
        },
        213: {
          id: 213,
          desc: "医生也不在农田",
          options: [
            {
              text: "去教堂找医生",
              next: 216
            }
          ]
        },
        214: {
          id: 214,
          desc: "医生不在农田",
          options: [
            {
              text: "去集市找医生",
              next: 215
            },
            {
              text: "去教堂找医生",
              next: 216
            }
          ]
        },
        215: {
          id: 215,
          desc: "医生也不在集市",
          options: [
            {
              text: "去教堂找医生",
              next: 216
            }
          ]
        },
        216: {
          id: 216,
          desc: "来到教堂，正巧碰到了从教堂走出来的医生，你告诉医生猎人的病情，医生的表情似乎有些不太对劲，过了一会医生给了你一个苹果，让你交给猎人并让他吃下去，你感到非常震惊，毕竟这是法律禁止的水果，为什么会成为治病的良药？",
          options: [
            {
              text: "收下苹果",
              result: [[0,0,0],[13],[217]]
            }
          ]
        },
        217: {
          id: 217,
          desc: "小丑又在扮演国王，看到了你，突然冲了过来指着你说你私藏了一颗苹果，你还没来得及解释，小丑立即从你的包中拿走了苹果，然后兴奋地逃走了，扮演国王用的皇冠却掉在了地上",
          condition: [[0,60,0],[]],
          options: [
            {
              text: "捡起皇冠",
              result: [[0,0,0],[-13,14],[218]]
            }
          ],
          once: true
        },
        218: {
          id: 218,
          desc: "你来到猎人的小屋，告诉猎人发生的一切，猎人表示医生很有问题，应当提高警惕，并且表示苹果一定是这一切的关键，不过他的病应该治不好了，这把弓就交给你吧",
          condition: [[0,70,0],[]],
          options: [
            {
              text: "收下弓",
              result: [[0,0,0],[15],[]]
            }
          ],
          once: true
        },
        //219
        //220-227 饥荒线
        220: {
          id: 220,
          desc: "最近在农场发生了一起命案，农场主被杀死在自家的仓库，在这个战火纷飞的年代，似乎并没有太多的人关注这件事，生离死别也成了百姓见怪不怪的一件事情，可你总觉得这起命案似乎不简单，自己也说不上来为什么...",
          condition: [[0,0,50],[]],
          options: [
            {
              text: "多留意一下有用的线索吧",
              result: [[0,0,0],[],[221,112]]
            }
          ],
          once: true
        },
        221: {
          id: 221,
          desc: "你拜访了被杀死的农场主的父亲，他已经六十多岁，曾经是这个农场的主人，儿子长大后就把活交给儿子打理。据老父亲描述，前一段日子经常有人，大概五个人左右的样子，半夜来到农场找儿子谈话，似乎还发生了争执，不知道是否与儿子被害有关",
          condition: [[0,0,60],[]],
          options: [
            {
              text: "那些人是谁？",
              next: 222
            },
            {
              text: "为了什么事情吵架？",
              next: 223
            }
          ],
          once: true
        },
        222: {
          id: 222,
          desc: "老农场主：他们的穿着好像挺华丽的，看起来不像是普通百姓，倒像是官人",
          options: [
            {
              text: "原来如此...",
              result: [[0,0,0],[],[224]]
            }
          ],
        },
        223: {
          id: 223,
          desc: "老农场主：似乎是为了农作物的一些事情，后来我问我儿子发生了什么事，他也没有告诉我",
          options: [
            {
              text: "原来如此...",
              result: [[0,0,0],[],[224]]
            }
          ],
        },
        224: {
          id: 224,
          desc: "你四处打听最近农场主的行踪，商人告诉你在3天前他见过农场主，然而不能白告诉你，需要一点情报费",
          condition: [[0,0,70],[]],
          options: [
            {
              text: "付钱",
              result: [[0,5,-10],[],[]],
              next: 225
            },
            {
              text: "离开",
              result: [[0,0,0],[],[227]],
            },
            {
              text: "用武力威胁",
              result: [[5,-10,0],[],[]],
              next: 225
            }
          ],
          once: true
        },
        225: {
          id: 225,
          desc: "商人告诉你在3天前的早上，他在城外运输货物准备进城的时候，看见了独自一人的农场主正往果林的方向走去，当时商人并没有在意这件事",
          options: [
            {
              text: "立即前往果林",
              next: 226
            }
          ]
        },
        226: {
          id: 225,
          desc: "你迅速来到城外的果林，这里是一片自然形成的树林，没有人专门打理，所以没有人会特意来到这里。你在附近寻找线索，最后在一颗树下发现了一样物品，那是一个小型天平，应该只是用来装饰的",
          options: [
            {
              text: "将天平收入背包",
              result: [[0,0,0],[16],[]],
            }
          ]
        },
        227: {
          id: 227,
          desc: "你来到城外的果林，这里是一片自然形成的树林，没有人专门打理，所以没有人会特意来到这里。你在附近寻找农场主的线索，最后在一颗树下发现了一样物品，那是一个小型天平，应该只是用来装饰的，这会不会和农场主的死有关...",
          options: [
            {
              text: "将天平收入背包",
              result: [[0,0,0],[16],[]],
            }
          ],
          once: true
        },
        //228
        //229
        //230-x 启示录事件

        1311: {
          id: 999,
          desc: "",
          options: [
            {
              text: "",
              result: [[0,0,0],[],[]]
            }
          ]
        },

        //404-424 杠三杠事件 最高收益15,20,20
        404: {
          id: 404,
          desc: "前方是一座城堡废墟，看起来已经废弃了很久，杂草丛生，丝毫没有人类活动的痕迹，这里曾经是幸运三杠的地盘，不知道发生了什么，变成如此一番景象",
          options: [
            {
              text: "走近看看",
              next: 405
            },
            {
              text: "就此离开",
            }
          ],
          once: true
        },
        405: {
          id: 405,
          desc: "翻开挡在路上的石头，前面似乎是主殿的残骸，关于这个幸运三杠，民间流传着很多传说，有的人说他的城堡里藏着很多宝藏",
          options: [
            {
              text: "试着找找看",
              result: [[-15,0,0],[404],[]],
              next: 406
            },
            {
              text: "就此离开",
            }
          ],
        },
        406: {
          id: 406,
          desc: "你在废墟当中发现一把乌金色的长杆铁器，比一般的铁器都要沉，最神奇的是它一直在发热...",
          options: [
            {
              text: "离开",
              result: [[],[],[407]]
            }
          ],
        },
        407: {
          id: 407,
          desc: "路过城外的时候，你偶然发现一个商人的货物里有一样东西与自己包里那把乌金长杵非常相像，只不过这个是墨绿色的。你上前去仔细观察，这根墨绿色的长杵也同样散发着热量\n商人见你对此物如此感兴趣，便问：那玩意就是根会发热的铁棒，顶多算是个奇物，没有什么实际用处，你要是寻思着有趣我就便宜卖你",
          options: [
            {
              text: "这东西你是从哪里搞来的",
              result: [[0,-5,0],[],[]],
              next: 408,
            },
            {
              text: "我有一个和这类似的东西",
              result: [[0,5,0],[],[]],
              next: 410,
            },
            {
              text: "我就是看看",
            }
          ],
          once: true
        },
        408: {
          id: 408,
          desc: "商人看了你一眼，告诉你这东西是他在很久之前从其他商队那里换来的，如果感兴趣他可以卖给你，但出价很高",
          options: [
            {
              text: "买",
              result: [[0,5,-20],[405],[]],
              next: 409,
            },
            {
              text: "不买",
            }
          ],
        },
        409: {
          id: 409,
          desc: "你从商人口中了解到，这东西产自锟铻山，是上古时期的兵器...",
          options: [
            {
              text: "...",
              result: [[],[],[412]]
            }
          ],
        },
        410: {
          id: 410,
          desc: "你把包里的乌金长杵拿出来，商人看到有一点惊讶，但立马掩饰住了情绪，开始仔细地观察起来，过了一会商人想花钱收了你的这个乌金的长棍",
          options: [
            {
              text: "看他这么来劲，就卖给他吧",
              result: [[0,5,20],[-404],[]],
              next: 411
            },
            {
              text: "不卖，转身离去",
            }
          ],
        },
        411: {
          id: 411,
          desc: "商人收下乌金长杵后，便匆匆收拾货物离开了",
          options: [
            {
              text: "...",
            }
          ],
        },
        412: {
          id: 412,
          desc: "你突然感觉自己的后背一热，慌忙之下检查自己的背包，发现是那两根神秘的杵已经开始发烫，于是你拿起两把长杵，口中喊道：",
          options: [
            {
              text: "白帝圣剑！御剑跟着我",
              result: [[0,0,10],[],[]],
              next: 413
            },
            {
              text: "德玛西亚！",
              result: [[10,0,0],[],[]],
              next: 413
            },
            {
              text: "烫烫烫！",
              next: 414
            },
            {
              text: "安胡拉阿克巴！",
              result: [[0,10,0],[],[]],
              next: 413
            }
          ],
          result: [[],[-404,-405],[]],
          once: true
        },
        413: {
          id: 413,
          desc: "你立马丢掉了它们，只见乌金色和墨绿色的杵掉落在地上后，熔化成了一滩黑水，还冒着难闻的气体，你捂着鼻子立马离开了此地...",
          options: [
            {
              text: "...",
            }
          ],
        },
        414: {
          id: 414,
          desc: "这时，你的背后不知何时出现了一个戴着黑色斗篷的人，看不清他的面容，他接过了你手中的两根发烫的杵，并告诉你这东西叫锟斤拷，是他遗失的东西\n为了感谢你帮他找回了两根锟斤拷，他决定帮助你，说完他就消失了",
          options: [
            {
              text: "这人难道就是..."
            }
          ],
          result: [[],[],[[420,424]]],
          eval: `this.notify("杠三杠奖励事件已加入事件池");`
        },
        //420-424 杠三杠的奖励事件
        420: {
          id: 420,
          desc: "经过一条河的时候，河里突然出现了一个河神，手里拿着一把金斧子和一把银斧子，问你哪一把是你的斧子",
          options: [
            {
              text: "金斧子",
              result: [[10,0,0],[],[]]
            },
            {
              text: "银斧子",
              result: [[0,0,10],[],[]]
            },
            {
              text: "都不是我的",
              result: [[0,10,0],[],[]]
            },
            {
              text: "我全都要",
              result: [[10,0,10],[],[]]
            },
          ],
          once: true
        },
        421: {
          id: 421,
          desc: "你在森林里巡逻的时候，突然发现一头微微发着蓝色的光的鹿从灌木丛中窜出来，看了你一眼，马上跑走了，你立马追上去，却发现它已经不见了...",
          options: [
            {
              text: "刚才那是...",
              result: [[10,10,10],[],[]]
            }
          ],
          once: true
        },
        422: {
          id: 422,
          desc: "小丑突然向你冲过来，傻笑着塞给你了一把钱，然后立马跑开了",
          options: [
            {
              text: "...",
              result: [[0,0,15],[],[]]
            }
          ],
          once: true
        },
        423: {
          id: 423,
          desc: "天上出现了三条彩虹，相互交叉围成了一个类似三角形的形状，周围的人们都在纷纷议论这一奇像",
          options: [
            {
              text: "这会是一种征兆吗...",
              result: [[10,10,0],[],[]]
            }
          ],
          once: true
        },
        424: {
          id: 424,
          desc: "森林里有三种蘑菇，红色的、紫色的和蓝色的，你要吃哪个？",
          options: [
            {
              text: "红色",
              result: [[5,0,0],[],[]]
            },
            {
              text: "紫色",
              result: [[0,5,0],[],[]]
            },
            {
              text: "蓝色",
              result: [[0,0,5],[],[]]
            }
          ],
          once: true
        },

        10086: {
          id: 10086,
          desc: `
          wrath | 愤怒 | war    | 战争 | 红马 | 大刀
          envy  | 嫉妒 | plague | 瘟疫 | 白马 | 弓和皇冠
          greed | 贪婪 | famine | 饥荒 | 黑马 | 天平
          ???   | ？？ | death  | 死亡 | 灰绿 | 镰刀？
          
          战争线  国王 铁匠（大刀） 小丑？
          瘟疫线  神父 医生 猎人（弓） 小丑？
          饥荒线  法官（天平） 农民 商人 小丑？
          剩余NPC：女巫 先知 炼金术士？
          `,
          disabled: true,
          condition: [[10,20,30],[1,233]],
          options: [
            {
              text: "这次是你赢了！",
              result: [[0,0,0],[],[]],
              eval: "",
              next: 10086
            }
          ],
          result: [[0,0,0],[],[]],
          eval: "",
          once: true,
        }
      }
    }
  }
}
