export default {
  data(){
    return{
      allEvents: {
        //0-1 剧情+教程
        0: {
          id: 0,
          desc: "初始文案",
          options: [
            {
              text: "...",
              next: 1
            }
          ],
          once: true
        },
        1: {
          id: 1,
          desc: "教程",
          options: [
            {
              text: "点我",
              result: [[5,0,0],[],[]]
            },
            {
              text: "点我吧",
              result: [[0,5,0],[],[]]
            },
            {
              text: "别信前面的",
              result: [[0,0,5],[],[]]
            }
          ],
          result: [[],[],[404]],
        },
        //2-4 死亡事件

        //404-424 杠三杠事件
        404: {
          id: 404,
          desc: "前方是一座城堡废墟，看起来已经废弃了很久，杂草丛生，丝毫没有人类活动的痕迹，这里曾经是幸运三杠的地盘，不知道发生了什么，变成如此一番景象",
          options: [
            {
              text: "走近看看",
              next: 405
            },
            {
              text: "就此离开",
            }
          ],
          once: true
        },
        405: {
          id: 405,
          desc: "翻开挡在路上的石头，前面似乎是主殿的残骸，关于这个幸运三杠，民间流传着很多传说，有的人说他的城堡里藏着很多宝藏",
          options: [
            {
              text: "试着找找看",
              result: [[-15,0,0],[404],[]],
              next: 406
            },
            {
              text: "就此离开",
            }
          ],
        },
        406: {
          id: 406,
          desc: "你在废墟当中发现一把乌金色的长杆铁器，比一般的铁器都要沉，最神奇的是它一直在发热...",
          options: [
            {
              text: "离开",
              result: [[],[],[407]]
            }
          ],
        },
        407: {
          id: 407,
          desc: "路过城外的时候，你偶然发现一个商人的货物里有一样东西与自己包里那把乌金长杵非常相像，只不过这个是墨绿色的。你上前去仔细观察，这根墨绿色的长杵也同样散发着热量\n商人见你对此物如此感兴趣，便问：那玩意就是根会发热的铁棒，顶多算是个奇物，没有什么实际用处，你要是寻思着有趣我就便宜卖你",
          options: [
            {
              text: "这东西你是从哪里搞来的",
              result: [[0,-5,0],[],[]],
              next: 408,
            },
            {
              text: "我有一个和这类似的东西",
              result: [[0,5,0],[],[]],
              next: 410,
            },
            {
              text: "我就是看看",
            }
          ],
          once: true
        },
        408: {
          id: 408,
          desc: "商人看了你一眼，告诉你这东西他也不知道什么来历，是很久之前从其他商队的人那里换来的",
          options: [
            {
              text: "买",
              result: [[0,5,-20],[405],[]],
              next: 409,
            },
            {
              text: "不买",
            }
          ],
        },
        409: {
          id: 409,
          desc: "商人把东西交给你之后，便匆匆收拾货物离开了",
          options: [
            {
              text: "...",
              result: [[],[],[412]]
            }
          ],
        },
        410: {
          id: 410,
          desc: "你把包里的乌金长杵拿出来，商人看到有一点惊讶，但立马掩饰住了情绪，开始仔细地观察起来，过了一会商人想花钱收了你的这个乌金的长棍",
          options: [
            {
              text: "看他这么来劲，就卖给他吧",
              result: [[0,5,20],[-404],[412]],
              next: 411
            },
            {
              text: "不卖，转身离去",
            }
          ],
        },
        411: {
          id: 411,
          desc: "商人收下乌金长杵后，便匆匆收拾货物离开了",
          options: [
            {
              text: "...",
            }
          ],
        },
        412: {
          id: 412,
          desc: "你突然感觉自己的后背一热，慌忙之下检查自己的背包，发现是那两根神秘的杵已经开始发烫，于是你拿起两把长杵，口中喊道：",
          options: [
            {
              text: "白帝圣剑！御剑跟着我",
              result: [[0,0,10],[],[]],
              next: 413
            },
            {
              text: "德玛西亚！",
              result: [[10,0,0],[],[]],
              next: 413
            },
            {
              text: "烫烫烫！",
              next: 414
            },
            {
              text: "安胡拉阿克巴！",
              result: [[0,10,0],[],[]],
              next: 413
            }
          ],
          result: [[],[-404,-405],[]],
          once: true
        },
        413: {
          id: 413,
          desc: "你立马丢掉了它们，只见乌金色和墨绿色的杵掉落在地上后，熔化成了一滩黑水，还冒着难闻的气体，你捂着鼻子立马离开了此地...",
          options: [
            {
              text: "...",
            }
          ],
        },
        414: {
          id: 414,
          desc: "这时，你的背后不知何时出现了一个戴着黑色斗篷的人，看不清他的面容，他接过了你手中的两根发烫的杵，并告诉你这东西叫锟斤拷，是他遗失的东西\n为了感谢你帮他找回了两根锟斤拷，他决定帮助你，以后的路会变得越来越好走的，说完他就消失了",
          options: [
            {
              text: "这人难道就是...",
            }
          ],
          result: [[],[],[[420,424]]]
        },
        //420-424 杠三杠的奖励事件
        420: {
          id: 420,
          desc: "",
          options: [
            {
              text: "",
            }
          ],
          result: []
        },
        421: {
          id: 421,
          desc: "",
          options: [
            {
              text: "",
            }
          ],
          result: []
        },
        422: {
          id: 422,
          desc: "",
          options: [
            {
              text: "",
            }
          ],
          result: []
        },
        423: {
          id: 423,
          desc: "",
          options: [
            {
              text: "",
            }
          ],
          result: []
        },
        424: {
          id: 424,
          desc: "",
          options: [
            {
              text: "",
            }
          ],
          result: []
        },
        3333: {
          id: 3333,
          desc: "你被雷劈了",
          options: [
            {
              text: "...",
              result: [[1,0,-1],[],[]]
            }
          ]
        },
        10086: {
          id: 10086,
          desc: `
          wrath | 愤怒 | war    | 战争 | 红马 | 大刀
          envy  | 嫉妒 | plague | 瘟疫 | 白马 | 弓和皇冠
          greed | 贪婪 | famine | 饥荒 | 黑马 | 天平
          ???   | ？？ | death  | 死亡 | 灰绿 | 镰刀？
          `,
          condition: [[10,20,30],[1,233]],
          options: [
            {
              text: "这次是你赢了！",
              result: [[0,0,0],[],[]],
              eval: "",
              next: 10086
            }
          ],
          result: [[0,0,0],[],[]],
          eval: "",
          once: true,
        }
      }
    }
  }
}
