<template>
  <div id="content">
    <div :class="{block: true, mobileBlock: isMobile}"
         v-if="!isMobile || item.mobile"
         v-for="(item, index) in gameList"
         :key="index"
         :style="{backgroundColor: item.color}">
      <div class="innerBlock" @click="goto(index)">
        <div class="name">{{(index+1) + '. ' + item.name}}</div>
        <div v-if="!isMobile" class="desc">{{item.desc}}</div>
      </div>
      <div v-if="item.loading" class="loading">
        <i class="el-icon-loading"></i>
      </div>
    </div>
  </div>
</template>

<style scoped lang="scss">
  #content {
    width: 100vw;
    height: 100vh;
    display: flex;
    flex-flow: row wrap;
    align-items: stretch;
    align-content: stretch;
    .block{
      min-width: 20%;
      flex: 1;
      position: relative;
      cursor: pointer;
      &.mobileBlock{
        min-width: 100%;
        .innerBlock{
          background-color: rgba(0,0,0,0);
          .name{
            color: rgba(0,0,0,.75);
          }
        }
      }
      .innerBlock{
        width: 100%;
        height: 100%;
        padding: 0 20px;
        box-sizing: border-box;
        background-color: rgba(0,0,0,0.5);
        transition: background-color 300ms;
        display: flex;
        flex-flow: column nowrap;
        justify-content: center;
        align-items: center;
        .name{
          color: rgba(255,255,255,.5);
          transition: color 500ms;
          font-size: 20px;
          font-weight: bold;
        }
        .desc{
          margin-top: 10px;
          color: rgba(255,255,255,.25);
          transition: color 500ms;
          font-size: 12px;
        }
        &:hover{
          background-color: rgba(0,0,0,0);
          .name{
            color: rgba(0,0,0,.75);
          }
          .desc{
            color: rgba(0,0,0,.5);
          }
        }
      }
      .loading{
        width: 100%;
        height: 100%;
        position: absolute;
        top: 0;
        left: 0;
        background-color: rgba(255,255,255,.5);
        display: flex;
        flex-flow: row nowrap;
        justify-content: center;
        align-items: center;
        color: white;
        font-size: 64px;
        cursor: no-drop;
      }
    }
  }
</style>

<script>
export default {
  name: 'gameMenu',
  data () {
    return {
      width: 0,
      isMobile: false,
      loading: false,
      gameList: [
        {
          name: "扫雷",
          path: "/minesweeper",
          desc: "经典扫雷，左键打开，右键插旗",
          color: "#b0b0b0",
          loading: false,
        },
        {
          name: "贪吃蛇",
          path: "/snake",
          desc: "贪吃蛇，WASD或方向键操控",
          color: "#707070",
          loading: false,
        },
        {
          name: "填色",
          path: "/color",
          desc: "填色使之成渐变状",
          color: "#ff5e52",
          loading: false,
        },
        {
          name: "连连看",
          path: "/link",
          desc: "经典连连看，左键操作，无解需要刷新重来",
          color: "#ffef6e",
          loading: false,
        },
        {
          name: "跳一跳",
          path: "/jump",
          desc: "横版跳跃游戏，WASD或方向键操控，开发中...",
          color: "#6df8ff",
          loading: false,
        },
        {
          name: "Picross",
          path: "/picross",
          desc: "经典Picross",
          color: "#5dffbd",
          loading: false,
        },
        {
          name: "猜数字",
          path: "/digital",
          desc: "经典猜数字游戏 - Bulls and Cows",
          color: "#e19bff",
          loading: false,
        },
        {
          name: "狼人杀上帝助手",
          path: "/wolf",
          desc: "狼人kill专用发牌器",
          color: "#ffbc64",
          loading: false,
          mobile: true,
        },
        {
          name: "12班去向图",
          path: "/graduate",
          desc: "110900010643",
          color: "#ff7381",
          loading: false,
          mobile: true,
        },
        {
          name: "地形生成器",
          path: "/eco",
          desc: "自主研发，已搁浅",
          color: "#6285ff",
          loading: false,
        },
        {
          name: "css画板",
          path: "/cssDraw",
          desc: "纯css画一些东西",
          color: "#a6ff5d",
          loading: false,
          mobile: true,
        },
        {
          name: "三灾",
          path: "/tower",
          desc: "移动端文字冒险游戏",
          color: "#ff8161",
          loading: false,
          mobile: true,
        },
        {
          name: "ccc专用小工具",
          path: "/ccc",
          desc: "ccc专用小工具",
          color: "#b75fff",
          loading: false,
        },
        {
          name: "魔方",
          path: "/magicCube",
          desc: "用three.js创建的魔方游戏，支持3-5阶，自由旋转视角",
          color: "#38ff38",
          loading: false,
          newTab: true,
        },
      ]
    }
  },
  created(){
    //禁止右键菜单
    document.oncontextmenu = function(){
      event.returnValue = false;
    };
    //禁止选择文本
    document.onselectstart = function(){
      event.returnValue = false;
    };
  },
  mounted(){
    this.width = window.innerWidth;
    this.isMobile = this.width < 450;
    if(this.isMobile){
      this.$message("移动端支持功能较少，使用pc端查看完整功能");
    }
    window.addEventListener("resize", event => {
      this.width = window.innerWidth;
      this.isMobile = this.width < 450;
    });
  },
  methods: {
    goto(index){
      if(!this.loading){
        if(this.gameList[index].newTab){
          let page = this.$router.resolve({
            path: this.gameList[index].path
          });
          window.open(page.href, '_blank');
        } else {
          this.gameList[index].loading = true;
          this.loading = true;
          this.$router.push(this.gameList[index].path, () => {
            this.gameList[index].loading = false;
            this.loading = false;
          });
        }
      }
    }
  }
}

/**
                           _ooOoo_
                          o8888888o
                          88" . "88
                          (| -_- |)
                           O\ = /O
                       ____/`---'\____
                     .   ' \\| |// `.
                      / \\||| : |||// \
                    / _||||| -:- |||||- \
                      | | \\\ - /// | |
                    | \_| ''\---/'' | |
                     \ .-\__ `-` ___/-. /
                  ___`. .' /--.--\ `. . __
               ."" '< `.___\_<|>_/___.' >'"".
              | | : `- \`.;`\ _ /`;.`/ - ` : | |
                \ \ `-. \_ __\ /__ _/ .-` / /
        ======`-.____`-.___\_____/___.-`____.-'======
                           `=---='

        .............................................
                 佛祖保佑             永无BUG
         佛曰:
                 写字楼里写字间，写字间里程序员；
                 程序人员写程序，又拿程序换酒钱。
                 酒醒只在网上坐，酒醉还来网下眠；
                 酒醉酒醒日复日，网上网下年复年。
                 但愿老死电脑间，不愿鞠躬老板前；
                 奔驰宝马贵者趣，公交自行程序员。
                 别人笑我忒疯癫，我笑自己命太贱；
                 不见满街漂亮妹，哪个归得程序员？

 */


/**
                                                                                                                                                                                                                                            .
                                                                                                                                                                                                                                            .
                                                                                                                                                                                                                                            .
                                                                                                                                                                                                                                            .
                                                                                                                                                                                                                                            .
                                                                                                                                    '!%%%!'                                                                                                 .
                                                                                                                               `!|%%%%%%%%%%%%|:.                                                                                           .
                                                                                                                           .;%%%%%%$$$$$$%%%%%%%%%%|;.                                                                                      .
                                                                                                                        '|%%%%%%%%%%$%%%%%%%%%%$$%%%%%|;.                                                                                   .
                                                                                                                    .;%%%%%%%%%%%%%%%%%%%%%%%%%%$$$%|!!|!'                                                                                  .
                                                                                                                 '|%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%!!!!|%|!:.                                                                                .
                                                             `':;;!||%:                                    .'!|%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%!!!!!!|%|!!!`                                                                               .
                                                         .;%%!:::::::;;;'            '|%%%%%%%%|!;::;|%$$$$$$%%%%%%%%%%%%%%%%%%%%%%%%%%%%%$%%|!!!!!!!|%%|!!!!:                                                                              .
                                                          .!$|`                  '|%%%%%%%%%%%%%%%%%$%%%%%%%%%%$%%%%%%%%%%%%%%%%%%%%%%%$%%%|!!!!!!!!!|%%%|!!!!;`                                                                            .
                                                            ;$|`            '|%%$$%%%%%%%%%%%%%%%%%%$$$%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%|!!!!!!!!!!||%%%|!!!!!!'                                                                           .
                                                             ;$|`      '!%$$$%%%%%%%%%%%%%%%%%%%%%%$$$$$$%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%!!!!!!!!!!!!!|%%%%|!!!!!!!;.                                                                         .
                                                              :%%%%%%%%|;`  .!%%%%%%%%%%%%%%%%%%%%%$$$$$$$$%%%%%$%%%$$%%$%%%%%$%$$$$%!!!!!!!!!!!!!!!|%%%%%|!!!!!!!!'                                                                        .
                                                                           .!%%%%%%%%%%%%$$%%%%%%%%$$$$$$$$$%%%%%%%%%%%%%%!:::::::;;::;!!!!!!!!!!!!|%%%%%%|!!!!!!!!!:.                                                                      .
                                                                          `!%%$$$$$$$$$$$$$$%%%%%%$$$$$$$$$%%%%%%%%%%%%%|!!;;;;;::::::::::!!!!!!!!!|%%%%%%|!!!!!!!!!!;`                                                                     .
                                                                        '|%%%$$$$$$$$$$$$$$$$%%%%%$$$$$$%%%%%%%%%%%%%%|!!!;;;;;;;;:::::::::::;!!!!||%%%%%%%|!!!!!!!!!!!:                                                                    .
                                                                     .!%|||%%%%%$$$$$$$$$$$$$$%%%%$$$$%%%%%%%%%%%%%%|!!!!!;;;;;;;;;;;::::::::::::!|%%%%%%%%|!!!!!!!!!|%|'                                                                   .
                                                                   `|%|||||%%%%%%%$$$$$$$$$$$$$%%%$%%%%%%%%%%%%%%%|!!!!!!;;;;;;;;;;;;;;:'''``````':;|%%%%%%|!!!!!!||%%%%!`                                                                  .
                                                                  :$$$$%||||%%%%%%%%$$$$$$$$$$$$$%%%%%%%%%%%%%%%|!!!!!!!!;;;;;;;;;;;;::;;'```````':;;;;|%%%%|!!!!|%%%%%%%;.                                                                 .
                                                                 !&$$$$$%||||%%%%%%%%%$$$$$$$$$&&&&&&$%%%%%%%%|!!!!!!!!!;;;;;;;;;;:::::;;;;'`````':;;;;;;;!%|!!|%%%%%%%%%;                                                                  .
                                                               `%&$$$$$$$$%||%%%%%%%%%%%%$$$$$&&&&&&&&&&&&$$|!!!!!!!!!!!;;;;;;;:::::::;;;;;;;'```':;;;;;;;;;!!!||%%%%%%%%:                                                                  .
                                                              :$&&$$$$$$$$$$%|%%%%%%%%%%%%%$&&&&&&&&&&&&%'      `;!!!!!;;;;:::::::::::;;;;;;;;;'`':;;;;!%$$%||!;;;;;;;;!!:.                                                                 .
                                                            .!&&&$$$$$$$$$$$$%%%%%%%%%%%%%%$&&&&&&&&$!.              `:;::::::::::::::;;;;;;;;;;::;|$$$$$$%|||!!;;;;;;'`';|%%%%|:.                                                          .
                                                           `|&&&&$$$$$$$$$$$$$$%%%%%%%%%%%%%$&&&&%'                  '!!||||||!!!;;:::;;:;!|%$&&&;      .;|||||!;;:`````:|||||:                                                             .
                                                          :%$%%%!'`.            `!|||||%%%%%$$!.                    ';;!||||||||||!;` :$&&&&&&&&;      `!||||||!;:''````;||||||!`                                                           .
                                                        .!$$$$!.                  :|||||||%%%%:                    ';;;!|||!!!!:.     '|%$&&&&&!      '|||||||!;;;;:::;'`;||||||||;`                                                        .
                                                       `|$$$%:                     `!|%%%%%%%%%|!`                ';;;;;!!|;.         `|%%%$&&!.     ;||||||!;;;;;;;;:`      :!%%%%%%%%!'                                                   .
                                                      :$$$$|`                        .;%%%%%%%%|||!:             ';;;;;;|%;      .:'  `!%%%%%!.      '||||!;;;;;;;;:'                                                                       .
                                                    .!$$$$:                              `!%%%%%|||||;.          `!!!!;;!:      :$&$||%%%%%|'         `!!;;:'.                                                                              .
                                                   '%$$$;                                    '|%%||||%$|`         :!!!|%|`    `%&&$%%%%%%%;.                                                                                                .
                                                  :$$$$:                                         :%&&&&&$:        :$$$$$$!`  :%&&$%%%%%%|'                                                                                                  .
                                                 ;&&&&&&;                                         :$&&&&&&!.     .!$$$$$$$!.        `;|;                                                                                                    .
                                                  !&&&&&&;                                         :|||||||!`    '%$$$$$$$$;                                                                                                                .
                                                  .!&&&&&&!                                                              .`'.                                                                                                               .
                                                                                                                                                                                                                                            .
                                                                                                                                                                                                                                            .
                                                                '`      !##|    .'.           !#&:       :&#|.            .%#&:    .:;`    ';:.         ;@#!     .%##!                                                                      .
                                                                '$#$'   !##|   `%@#|.       .|#@|!&&&&&&&@##@&&&&&&&!.    .%#&:    ;@#@&$$&@#@:         ;@#!     !@#|.     `%@|.                                                            .
                                                                 .%##|  !@#|  .|#&:        :&@|.         !#@;             .%@&:    ;##|   `%#&:         ;@#!    ;@#$!!!!!!!|&@$`                                                            .
                                                              `:' .|%`  !##| .|$`  :!:   '$$'  .  ;@#@@@@@#@@@@@@@@!   :||%@#@$||!`;@#|   `%#@:     `;;|&##%;;'!@@;        `$#$`                                                            .
                                                             `%#@$%%%%%%%%%%%%%%%%$@#&'      `%#@!;@@; ;@$`.|#! '&#!      !##&:    ;@#|   `%#@:        ;@##!  ;@!  !@$'    '$#%`                                                            .
                                                             `%#&:                `$#&'     `%#@: :@@; ;@$`.|@! '&#!     '$#@@$'   ;##|   `%#@:       '$@##@!.    :&#$`    '$#%`                                                            .
                                                             `%#&:  ;@@$||||$@#!  `$@&'    '$##!  ;@#&%%%%%%%%%%$@#!     |##@&%&@; !##!   `%#@:       |#@##||#$` `$#%`     '$#%`                                                            .
                                                             `%#&:  !#@;    :@#!  `$@&'   ;@##@!                        ;@&&#&:;@%'|#@;   `%#@:      ;@|!@#!'$&:.%@! .|&:  '&#%`                                                            .
                                                             `%#&:  !#@;    :@#!  `$@&' .||.;@#!.:!!!!!!!$$!!!;;!;;;:. '&|'%#&:   `%#$'   `%#@:     '&! ;@#!   .%%`  .:$#%`:&#%.                                                            .
                                                             `%#&:  !#@;    :@#!  `$#&'     ;@#!   ``.%@|`;@@|. '`    '%; .%#&:   ;@#!    `%#@:    '|:  ;@#!  '&####@%:;&#|;&#|.                                                            .
                                                             `%#&:  !##%::::|@#!  `$#&'     ;@#!  !@;`%#%` :&;  `%#&:     .%#&:  '$#|.    `%#@:         ;@#!            '' :&#|.                                                            .
                                                             `%#&:                '$#&'     ;##!:&#&'`%#$:       .%#$'    .%@&: `%@!      .|##$!;;:.    ;@#;               !@#!                                                             .
                                                             `%#&:             '$##@@%`     ;@#! ';`  :&#######$`         .%#&:'$$'        '&#@###%.    ;@#!           :&####&:                                                             .
                                                              '!:.              `;;:.       `;;`                           :|;`:`                       .;;`            .;!:.                                                               .
                                                                                                                                                                                                                                            .
                                                                                                                                                                                                                                            .
                                                                                  :%$|'  '!`   '!` :!.   '!` '!`        .!'    '|'   .!: .!%%%|'    '|$%:                                                                                   .
                                                                                '$;      ;$'   ;$' !#&:  :$: ;$'        |@$'   :&@!  `%! `$;   |$'`%!                                                                                       .
                                                                                `%&!'    ;$'   ;$' !%|&! :$: ;$'       ;$'!%`  :$|%%``%! `$;   '$:.|&!'.                                                                                    .
                                                                                    .;&! ;$'   ;$' !%``%%|$: ;$'      '$; .%!  :$: !&|%! `$;   '$:    .;$|.                                                                                 .
                                                                                 `.  .%|.'$!  `%%. !%`  !@&: ;$'     `%$|!!%&; :$:  :&#! `$;  .|$` `.   |%`                                                                                 .
                                                                                 `;||!`    '!|;`   :;.   '!` '|||||!':;.    '!.`;`   .;' .;|||!`   .;||!`                                                                                   .
                                                                                                                                                                                                                                            .
                                                                                                                                                                                                                                            .
                                                                                                                                                                                                                                            .
                                                                                                                                                                                                                                            .
                                                                                                                                                                                                                                            .
                                                                                                                                                                                                                                            .

 */

/**
 * ┌───┐   ┌───┬───┬───┬───┐ ┌───┬───┬───┬───┐ ┌───┬───┬───┬───┐ ┌───┬───┬───┐
 * │Esc│   │ F1│ F2│ F3│ F4│ │ F5│ F6│ F7│ F8│ │ F9│F10│F11│F12│ │P/S│S L│P/B│  ┌┐    ┌┐    ┌┐
 * └───┘   └───┴───┴───┴───┘ └───┴───┴───┴───┘ └───┴───┴───┴───┘ └───┴───┴───┘  └┘    └┘    └┘
 * ┌───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───────┐ ┌───┬───┬───┐ ┌───┬───┬───┬───┐
 * │~ `│! 1│@ 2│# 3│$ 4│% 5│^ 6│& 7│* 8│( 9│) 0│_ -│+ =│ BacSp │ │Ins│Hom│PUp│ │N L│ / │ * │ - │
 * ├───┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─────┤ ├───┼───┼───┤ ├───┼───┼───┼───┤
 * │ Tab │ Q │ W │ E │ R │ T │ Y │ U │ I │ O │ P │{ [│} ]│ | \ │ │Del│End│PDn│ │ 7 │ 8 │ 9 │   │
 * ├─────┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴─────┤ └───┴───┴───┘ ├───┼───┼───┤ + │
 * │ Caps │ A │ S │ D │ F │ G │ H │ J │ K │ L │: ;│" '│ Enter  │               │ 4 │ 5 │ 6 │   │
 * ├──────┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴────────┤     ┌───┐     ├───┼───┼───┼───┤
 * │ Shift  │ Z │ X │ C │ V │ B │ N │ M │< ,│> .│? /│  Shift   │     │ ↑ │     │ 1 │ 2 │ 3 │   │
 * ├─────┬──┴─┬─┴──┬┴───┴───┴───┴───┴───┴──┬┴───┼───┴┬────┬────┤ ┌───┼───┼───┐ ├───┴───┼───┤ E││
 * │ Ctrl│ Fn │Alt │         Space         │ Alt│Win │-3- │Ctrl│ │ ← │ ↓ │ → │ │   0   │ . │←─┘│
 * └─────┴────┴────┴───────────────────────┴────┴────┴────┴────┘ └───┴───┴───┘ └───────┴───┴───┘
 */


/**
 *
 *   █████▒█    ██  ▄████▄   ██ ▄█▀       ██████╗ ██╗   ██╗ ██████╗
 * ▓██   ▒ ██  ▓██▒▒██▀ ▀█   ██▄█▒        ██╔══██╗██║   ██║██╔════╝
 * ▒████ ░▓██  ▒██░▒▓█    ▄ ▓███▄░        ██████╔╝██║   ██║██║  ███╗
 * ░▓█▒  ░▓▓█  ░██░▒▓▓▄ ▄██▒▓██ █▄        ██╔══██╗██║   ██║██║   ██║
 * ░▒█░   ▒▒█████▓ ▒ ▓███▀ ░▒██▒ █▄       ██████╔╝╚██████╔╝╚██████╔╝
 *  ▒ ░   ░▒▓▒ ▒ ▒ ░ ░▒ ▒  ░▒ ▒▒ ▓▒       ╚═════╝  ╚═════╝  ╚═════╝
 *  ░     ░░▒░ ░ ░   ░  ▒   ░ ░▒ ▒░
 *  ░ ░    ░░░ ░ ░ ░        ░ ░░ ░
 *           ░     ░ ░      ░  ░
 */

</script>
